kizua_mwangola/part_11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-02 Fri 10:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kizua Mwangola: Part 11: Newspaper men</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Kizua Mwangola: Part 11: Newspaper men</h1>
<p>
<a href="index.html">Back to chapter index.</a>
</p>

<p>
Tuesday, January 19, 2010
</p>

<p>
Our days have been incredibly busy of late. Not only because I'm
spending longer hours at the tech support at Uni but also because the
cream of the reporting crop is staying at our guest house: being the
only hotel with a name in English and having an American expat running
it makes it the obvious choice for every other English-speaking
foreigner. These are famous people in their fields, contributers to
papers such as Financial Times, Daily Telegraph, The Independent, Die
Spiegel, BBC, et al. This, of course, excluding Nigerian and Angolan
papers.
</p>

<p>
All this excitement not only makes my tech support somewhat harder &#x2014;
we now have people that rely on the Internet to do proper work rather
than the occasional browsing &#x2014; but it also means me and even Shahin
are on "translation duties" at all hours. For example, yesterday I
translated an interview with the Zambian coach for local
newspapers. I've also spoken quite a lot of really bad French (but
fortunately, the Swiss are here to help!). Shahin's claim to fame is
translating French to Portuguese, the unfortunate targets being our
Gabonese guests. I've also been <a href="http://www.earthtimes.org/articles/show/304652,excuse-me-is-there-any-football-being-played-here--feature.html">quoted</a> <a href="http://www.guardian.co.uk/football/blog/2010/jan/18/angola-africa-cup-of-nations">twice</a> (if not entirely
precisely). And to top it all off, we're traveling to Lubango tomorrow
with journalist and <a href="http://www.amazon.co.uk/Inverting-Pyramid-History-Football-Tactics/dp/1409102041/ref=pd_bxgy_b_text_c">book author</a>, <a href="http://www.guardian.co.uk/profile/jonathanwilson">Jonathan Wilson</a> &#x2014; a gem of a bloke
by the way. Mind you, <a href="http://www.pfd.co.uk/client/peter_auf_der_heyde/books/?section=books_authors">Pete</a> was looking over my shoulder as I write
this and he swears that <a href="http://www.amazon.com/Has-Anybody-Got-Whistle-Football/dp/1903158311">his book</a> is better for the common man, so I
may end up buying both.
</p>

<p>
There is nothing scarier than watching a football match on telly with
five or ten of these guys. You just feel afraid of shouting even the
most trivial things, lest they look at you with disapproving eyes &#x2014;
"do you know <span class="underline">anything</span> at all about football, young man?". On the
plus side, they are a really great bunch to chat over a few
cucas. There were a couple of comments that really made me laugh. One
was that "the stadiums were just too good, you couldn't tell whether
this was Germany or Angola" which made me pretty laugh pretty
smugly. Apparently Ghana and Mali's African cup had a more African
feel. Don't want to discriminate against our African brothers, but
I'll take that as a compliment. The other, which made me laugh really
hard was &#x2014; "I hate those Scandinavians! Their biggest problem is a
complete lack of cynicism! I mean, just look all the NGO's they have
which actually <span class="underline">believe</span> in changing the world!". I wish all my
Scandinavian friends could read this now.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="part_10.html">Back to previous chapter</a></td>
<td class="org-left"><a href="index.html">Back to chapter index.</a></td>
<td class="org-left"><a href="part_12.html">Forward to next chapter</a></td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-04-02 Fri 10:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
